using System;

namespace ЛР12
{
    class Program
    {
        static void Main()
        {
            Console.WriteLine("Введите номер задания от 1 до 5:");
            string n = Console.ReadLine();
            switch (n)
            {
                case "1":
                    Console.WriteLine("Введите номер дня:");
                    int day = int.Parse(Console.ReadLine());
                    Console.WriteLine("Введите номер месяца:");
                    int month = int.Parse(Console.ReadLine());
                    string[] months = new string[] { "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "окрября", "ноября", "декабря" };
                    string[] days = new string[] { "первое", "второе", "третье", "четвёртое", "пятое", "шестое", "седьмое", "восьмое", "девятое", "десятое", "одиннадцатое", "двенадцатое", "тринадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое", "девятнадцатое", "двадцатое", "двадцать первое", "двадцать второе", "двадцать третье", "двадцать четвёртое", "двадцать пятое", "двадцать шестое", "двадцать седьмое", "двадцать восьмое", "двадцать девятое", "тридцатое", "тридцать первое" };
                    Console.WriteLine($"{days[day - 1]} {months[month - 1]}");
                    break;
                case "2":
                    Console.WriteLine("Введите направление(С/З/Ю/В):");
                    string C = Console.ReadLine();
                    Console.WriteLine("Введите цифровую команду(0/1/-1):");
                    int N = int.Parse(Console.ReadLine());
                    char c='0';
                    switch (C)
                    {
                        case "С":
                            switch (N)
                            {
                                case 0:
                                    c = 'С';
                                    break;
                                case 1:
                                    c = 'З';
                                    break;
                                case -1:
                                    c = 'В';
                                    break;
                            }
                            break;
                        case "З":
                            switch (N)
                            {
                                case 0:
                                    c = 'З';
                                    break;
                                case 1:
                                    c = 'Ю';
                                    break;
                                case -1:
                                    c = 'С';
                                    break;
                            }
                            break;
                        case "Ю":
                            switch (N)
                            {
                                case 0:
                                    c = 'Ю';
                                    break;
                                case 1:
                                    c = 'В';
                                    break;
                                case -1:
                                    c = 'З';
                                    break;
                            }
                            break;
                        case "В":
                            switch (N)
                            {
                                case 0:
                                    c = 'В';
                                    break;
                                case 1:
                                    c = 'С';
                                    break;
                                case -1:
                                    c = 'Ю';
                                    break;
                            }
                            break;
                    }
                    Console.WriteLine($"Направление:" + c);
                    break;
                case "3":
                    Console.WriteLine("Введите целое число от 10 до 40:");
                    int num = int.Parse(Console.ReadLine());
                    string[] number = new string[] { "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать", "двадцать", "двадцать одно", "двадцать два", "двадцать три", "двадцать четыре", "двадцать пять", "двадцать шесть", "двадцать семь", "двадцать восемь", "двадцать девять", "тридцать", "тридцать одно", "тридцать два", "тридцать три", "тридцать четыре", "тридцать пять", "тридцать шесть", "тридцать семь", "тридцать восемь", "тридцать девять", "сорок" };
                    Console.WriteLine($"{number[num - 10]} учебных заданий");
                    break;
                case "4":
                    Console.WriteLine("Введите целое число от 100 до 999:");
                    int numb = int.Parse(Console.ReadLine());
                    string[] n1 = new string[] { "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот" };
                    string[] n2 = new string[] { "", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемдесят", "девяносто" };
                    string[] n3 = new string[] { "", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять" };
                    string[] n11_19 = new string[] { "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать" };
                    int c1 = numb / 100;
                    if (numb % 100 > 10 & numb % 100 < 20) Console.WriteLine($"{n1[c1 - 1]} {n11_19[numb % 100 - 11]}");
                    int r = numb % 100;
                    int c2 = r/10;
                    int c3 = r%10;
                    Console.WriteLine($"{n1[c1 - 1]} {n2[c2 - 1]} {n3[c3 - 1]}");
                    break;
                case "5":
                    Console.WriteLine("Введите год от 1984 до 2044:");
                    int y = int.Parse(Console.ReadLine());
                    string[] y2 = new string[] { "крысы", "коровы", "тигра", "зайца", "дракона", "змеи", "лошади", "овцы", "обезьяны", "курицы", "собаки", "свиньи" };
                    string[] y1 = new string[] { "зеленый", "красный", "желтый", "белый", "черный" };
                    int y11=0;
                    if (y % 10 == 0 || y % 10 == 1) y11 = 3;
                    if (y % 10 == 2 || y % 10 == 3) y11 = 4; 
                    if (y % 10 == 4 || y % 10 == 5) y11 = 0; 
                    if (y % 10 == 6 || y % 10 == 7) y11 = 1; 
                    if (y % 10 == 8 || y % 10 == 9) y11 = 2;
                    int yi = (y + 8) % 12;
                    int y22=0;
                    if (yi == 0) y22 = 0;
                    if (yi == 1) y22 = 1;
                    if (yi == 2) y22 = 2;
                    if (yi == 3) y22 = 3;
                    if (yi == 4) y22 = 4;
                    if (yi == 5) y22 = 5;
                    if (yi == 6) y22 = 6;
                    if (yi == 7) y22 = 7;
                    if (yi == 8) y22 = 8;
                    if (yi == 9) y22 = 9;
                    if (yi == 10) y22 = 10;
                    if (yi == 11) y22 = 11;
                    Console.WriteLine($"Год {y1[y11]} {y2[y22]}");
                    break;
            }
        }
    }
}
